**Data Cleaning Assignment**

In [0]:
import pandas as pd
import numpy as np

In [0]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [0]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [0]:
new_index = np.arange(1, df['From_To'].count()+1)
df.set_index(new_index, inplace=True)
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN           NaN            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis           NaN          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

**1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).**

In [0]:
for i in range(1, df['FlightNumber'].count() + 1):
      if pd.isnull(df.loc[i,'FlightNumber']):
          df.loc[i, 'FlightNumber'] = df.loc[i-1, 'FlightNumber'] + 10

df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN       10055.0            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis       10075.0          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [0]:
df['FlightNumber'] = df['FlightNumber'].astype(int)

In [0]:
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris         10045      [23, 47]               KLM(!)
2      MAdrid_miLAN         10055            []    <Air France> (12)
3  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis         10075          [13]       12. Air France
5   Brussels_londOn         10085      [67, 32]          "Swiss Air"

**2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.**

In [0]:
temp_df = df.copy()
temp_df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris         10045      [23, 47]               KLM(!)
2      MAdrid_miLAN         10055            []    <Air France> (12)
3  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis         10075          [13]       12. Air France
5   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [0]:
temp_df[['From','To']] = temp_df['From_To'].str.split('_', expand=True)
temp_df

            From_To  FlightNumber  ...      From         To
1      LoNDon_paris         10045  ...    LoNDon      paris
2      MAdrid_miLAN         10055  ...    MAdrid      miLAN
3  londON_StockhOlm         10065  ...    londON  StockhOlm
4    Budapest_PaRis         10075  ...  Budapest      PaRis
5   Brussels_londOn         10085  ...  Brussels     londOn

[5 rows x 6 columns]

**3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)**

In [0]:
temp_df['From'],temp_df['To'], temp_df['From_To'] = temp_df['From'].str.capitalize(), temp_df['To'].str.capitalize(), temp_df['From_To'].str.capitalize()

In [0]:
temp_df

            From_To  FlightNumber  ...      From         To
1      London_paris         10045  ...    London      Paris
2      Madrid_milan         10055  ...    Madrid      Milan
3  London_stockholm         10065  ...    London  Stockholm
4    Budapest_paris         10075  ...  Budapest      Paris
5   Brussels_london         10085  ...  Brussels     London

[5 rows x 6 columns]

**4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.**

In [0]:
df.drop('From_To', axis=1)

   FlightNumber  RecentDelays              Airline
1         10045      [23, 47]               KLM(!)
2         10055            []    <Air France> (12)
3         10065  [24, 43, 87]  (British Airways. )
4         10075          [13]       12. Air France
5         10085      [67, 32]          "Swiss Air"

In [0]:
df['From'],df['To'] = temp_df['From'],temp_df['To']

In [0]:
df

            From_To  FlightNumber  ...      From         To
1      LoNDon_paris         10045  ...    London      Paris
2      MAdrid_miLAN         10055  ...    Madrid      Milan
3  londON_StockhOlm         10065  ...    London  Stockholm
4    Budapest_PaRis         10075  ...  Budapest      Paris
5   Brussels_londOn         10085  ...  Brussels     London

[5 rows x 6 columns]

In [0]:
df = df.drop('From_To', axis=1)

In [0]:
df

   FlightNumber  RecentDelays              Airline      From         To
1         10045      [23, 47]               KLM(!)    London      Paris
2         10055            []    <Air France> (12)    Madrid      Milan
3         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
4         10075          [13]       12. Air France  Budapest      Paris
5         10085      [67, 32]          "Swiss Air"  Brussels     London

**5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.**

In [0]:
delays = pd.DataFrame(df['RecentDelays'].values.tolist())
delays

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [0]:
col_dict = {0:'Delay1', 1:'Delay2', 2:'Delay3'}
delays = delays.rename(columns=col_dict)

In [0]:
delays

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [0]:
df = pd.concat([df, delays], axis=1)

In [0]:
df

   FlightNumber  RecentDelays              Airline  ... Delay1 Delay2  Delay3
0           NaN           NaN                  NaN  ...   23.0   47.0     NaN
1       10045.0      [23, 47]               KLM(!)  ...    NaN    NaN     NaN
2       10055.0            []    <Air France> (12)  ...   24.0   43.0    87.0
3       10065.0  [24, 43, 87]  (British Airways. )  ...   13.0    NaN     NaN
4       10075.0          [13]       12. Air France  ...   67.0   32.0     NaN
5       10085.0      [67, 32]          "Swiss Air"  ...    NaN    NaN     NaN

[6 rows x 8 columns]

In [0]:
df.drop('RecentDelays', axis=1)

   FlightNumber              Airline      From  ... Delay1  Delay2  Delay3
0           NaN                  NaN       NaN  ...   23.0    47.0     NaN
1       10045.0               KLM(!)    London  ...    NaN     NaN     NaN
2       10055.0    <Air France> (12)    Madrid  ...   24.0    43.0    87.0
3       10065.0  (British Airways. )    London  ...   13.0     NaN     NaN
4       10075.0       12. Air France  Budapest  ...   67.0    32.0     NaN
5       10085.0          "Swiss Air"  Brussels  ...    NaN     NaN     NaN

[6 rows x 7 columns]